
# Напишите программу, которая принимает на вход цифру,
#  обозначающую день недели, и проверяет, является ли 
# этот день выходным.

print('Введите число от 1 до 7:');
a = int(input())
if a == 6 or a == 7:
    print('выходной')
else:
    print('рабочий день')





